In [17]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [75]:
import pandas as pd
import numpy as np
import psycopg2

In [2]:
%sql postgresql://postgres:admin@localhost/sparkifydb

In [18]:
conn = psycopg2.connect("host=localhost dbname=sparkifydb user=postgres password=admin port=5432")

# Preguntas An√°lisis de datos

<img src="img/Olap.jpg" width=600 height=600 />

### Top 5 Artistas con mas Canciones

In [63]:
%%sql 
SELECT a.artist_id,
       a.name,
       count(s.song_id) n
FROM songs s
     INNER JOIN artists a ON (s.artist_id = a.artist_id)
GROUP BY 1,2
ORDER BY 3 DESC,2 DESC
limit 5;

 * postgresql://postgres:***@localhost/sparkifydb
5 rows affected.

[('ARXOKNT1187B9AA521', 'K.A.L.I.', 3),
 ('AR7GOK91187FB455F5', 'Jean-Jacques Goldman', 3),
 ('ARRJ3UC1187FB579D7', 'Wyclef Jean', 2),
 ('AR051KA1187B98B2FF', 'Wilks', 2),
 ('ARI945I1187FB4CC22', 'The King Sisters', 2)]

In [65]:
df_s = pd.read_sql('select * from songs', con=conn)
df_a = pd.read_sql('select * from artists', con=conn)

pd.merge(df_s, df_a, on="artist_id") \
  .filter(items=["artist_id","name","song_id"]) \
  .groupby(["artist_id","name"]) \
  .count() \
  .sort_values(["song_id","name"], ascending=False, axis=0) \
  .head(5)

                                         song_id
artist_id          name
ARXOKNT1187B9AA521 K.A.L.I.                    3
AR7GOK91187FB455F5 Jean-Jacques Goldman        3
ARRJ3UC1187FB579D7 Wyclef Jean                 2
AR051KA1187B98B2FF Wilks                       2
ARI945I1187FB4CC22 The King Sisters            2

### Dia de la semana en el que se esuchan mas canciones

In [66]:
%%sql 
SELECT case t.weekday
            when '0' then 'Lunes'
            when '1' then 'Martes'
            when '2' then 'Miercoles'
            when '3' then 'Jueves'
            when '4' then 'Viernes'
            when '5' then 'Sabado'
            when '6' then 'Domingo'
            else 'Null'
        end,
       count(songplay_id) n_canciones
FROM songplays s
     INNER JOIN time t ON (s.start_time = t.start_time)
GROUP BY 1
ORDER BY 2 DESC;

 * postgresql://postgres:***@localhost/sparkifydb
7 rows affected.

[('Lunes', 41785),
 ('Miercoles', 41390),
 ('Martes', 39249),
 ('Jueves', 36683),
 ('Viernes', 34586),
 ('Sabado', 24077),
 ('Domingo', 17158)]

In [98]:
df_s = pd.read_sql('select * from songplays', con=conn)
df_t = pd.read_sql('select * from time', con=conn)

def classify_weekday(weekday):
    if weekday == '0':
        return 'Lunes'
    elif weekday == '1':
        return 'Martes'
    elif weekday == '2':
        return 'Miercoles'
    elif weekday == '3':
        return 'Jueves'
    elif weekday == '4':
        return 'Viernes'
    elif weekday == '5':
        return 'Sabado'
    elif weekday == '6':
        return 'Domingo'
    else:
        return 'Null'

df_t['weekday'] = df_t['weekday'].apply(classify_weekday)

pd.merge(df_s, df_t, on="start_time") \
  .filter(items=["weekday","songplay_id"]) \
  .groupby("weekday") \
  .count() \
  .sort_values("songplay_id", ascending=False, axis=0)

           songplay_id
weekday
Lunes            41785
Miercoles        41390
Martes           39249
Jueves           36683
Viernes          34586
Sabado           24077
Domingo          17158

### Cuales usuarios (Nombre y apellido) en la history de la App han escuchado la cancion: 'Streets On Fire (Explicit Album Version)'

In [110]:
%%sql 
SELECT distinct
       u.first_name,
       u.last_name
FROM users u
     INNER JOIN songplays p ON (u.user_id = p.user_id)
     INNER JOIN songs s ON (p.song_id = s.song_id)
WHERE s.title = 'Streets On Fire (Explicit Album Version)' 
ORDER BY 1 ASC;

 * postgresql://postgres:***@localhost/sparkifydb
5 rows affected.

[('Alexander', 'Garcia'),
 ('Alyssia', 'Campbell'),
 ('Brisa', 'Murray'),
 ('Calvin', 'Marshall'),
 ('Payton', 'Campbell')]

In [111]:
df_p = pd.read_sql('select * from songplays', con=conn)
df_s = pd.read_sql('select * from songs', con=conn)
df_u = pd.read_sql('select * from users', con=conn)

pd.merge(pd.merge(df_u, df_p, on="user_id"), 
         df_s.query("title == 'Streets On Fire (Explicit Album Version)'"),
         on="song_id") \
  .filter(items=["first_name","last_name"]) \
  .sort_values("first_name", ascending=True, axis=0) \
  .drop_duplicates()

  first_name last_name
0  Alexander    Garcia
6    Alyssia  Campbell
1      Brisa    Murray
3     Calvin  Marshall
4     Payton  Campbell

### Canciones mas escuchadas

In [129]:
%%sql
SELECT l.song_id,
       s.title,
       t.month,
       t.year,
       count(*)
FROM songplays l
     INNER JOIN songs s ON (l.song_id = s.song_id)
     INNER JOIN time t ON (l.start_time = t.start_time)
GROUP BY 1,2,3,4
ORDER BY 5 DESC,2 DESC
LIMIT 10;

 * postgresql://postgres:***@localhost/sparkifydb
10 rows affected.

[('SOAOPCG12AC468D27E', 'Everything In Its Right Place', 10, 2018, 24),
 ('SOTEFFR12A8C144765', 'A Dustland Fairytale', 10, 2018, 22),
 ('SOMKGQN12A8C1339D2', 'Blue Orchid', 10, 2018, 14),
 ('SOTEFFR12A8C144765', 'A Dustland Fairytale', 11, 2018, 7),
 ('SOWQTQZ12A58A7B63E', 'Streets On Fire (Explicit Album Version)', 10, 2018, 5),
 ('SOZCTXZ12AB0182364', 'Setanta matins', 10, 2018, 3),
 ('SONCELS12A58A7D2A7', 'No Ordinary Love (Remastered LP Version)', 10, 2018, 3),
 ('SOMKGQN12A8C1339D2', 'Blue Orchid', 11, 2018, 3),
 ('SOFLDSU12AC4689B1C', 'At the Club', 10, 2018, 3),
 ('SODREIN12A58A7F2E5', 'A Whiter Shade Of Pale (Live @ Fillmore West)', 10, 2018, 3)]

In [130]:
df_l = pd.read_sql('select * from songplays', con=conn)
df_s = pd.read_sql('select * from songs', con=conn)
df_t = pd.read_sql('select * from time', con=conn)

pd.merge(pd.merge(df_l, df_s, on="song_id", suffixes=('_l', '_s')),
         df_t, on="start_time", suffixes=('_s', '_t')) \
  .filter(items=["songplay_id","song_id","title","month","year_t"]) \
  .groupby(["song_id","title","month","year_t"]) \
  .count() \
  .sort_values(["songplay_id","title"], ascending=False, axis=0) \
  .head(10)

                                                                               songplay_id
song_id            title                                         month year_t
SOAOPCG12AC468D27E Everything In Its Right Place                 10    2018             24
SOTEFFR12A8C144765 A Dustland Fairytale                          10    2018             22
SOMKGQN12A8C1339D2 Blue Orchid                                   10    2018             14
SOTEFFR12A8C144765 A Dustland Fairytale                          11    2018              7
SOWQTQZ12A58A7B63E Streets On Fire (Explicit Album Version)      10    2018              5
SOZCTXZ12AB0182364 Setanta matins                                10    2018              3
SONCELS12A58A7D2A7 No Ordinary Love (Remastered LP Version)      10    2018              3
SOMKGQN12A8C1339D2 Blue Orchid                                   11    2018              3
SOFLDSU12AC4689B1C At the Club                                   10    2018              3
SODREIN12A58A7F2E5 A Whiter Shade Of Pale (Live @ Fillmore West) 10    2018              3